Java/java-string.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-08-16 周四 08:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>String/SB</title>
<meta name="generator" content="Org mode">
<meta name="author" content="某某人">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">String/SB</h1>
</header><p>
总结:
</p>
<ul class="org-ul">
<li>为了优化效率，String 使用了常量池方式实现。但偏偏在大量字符串拼接的地方，效率特别特别低</li>
<li>StringBuffer 是线程安全的；StringBuilder 不是。</li>
<li>StringBuffer 因为使用了 Synchronized 保证安全，所以慢。</li>
<li>StringBuilder 没有做线程安全处理，但是它最快。</li>
<li>能用 StringBuilder 的地方，不要使用 StringBuffer。在大量拼接的地方，不要使用 String</li>
</ul>

<p>
测试三种的效率差别:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span> (<span class="org-type">String</span>... <span class="org-variable-name">args</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">N</span> = 77777777;
    <span class="org-type">long</span> <span class="org-variable-name">t</span>;

    {
        <span class="org-type">StringBuffer</span> <span class="org-variable-name">sb</span> = <span class="org-keyword">new</span> <span class="org-type">StringBuffer</span>();
        t = System.currentTimeMillis();
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">N</span>; i++) {
            sb.append(<span class="org-string">"."</span>);
        }
        System.out.println(System.currentTimeMillis() - t);
    }

    {
        <span class="org-type">StringBuilder</span> <span class="org-variable-name">sb</span> = <span class="org-keyword">new</span> <span class="org-type">StringBuilder</span>();
        t = System.currentTimeMillis();
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">N</span>; i++) {
            sb.append(<span class="org-string">"."</span>);
        }
        System.out.println(System.currentTimeMillis() - t);
    }

    {
        <span class="org-type">String</span> <span class="org-variable-name">origin</span> = <span class="org-string">""</span>;
        t = System.currentTimeMillis();
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">N</span>; i++) {
            origin += <span class="org-string">'.'</span>;
        }
        System.out.println(System.currentTimeMillis() - t);
    }
}
</pre>
</div>

<p>
测试线程安全性:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span> (<span class="org-type">String</span>... <span class="org-variable-name">args</span>) {
    <span class="org-type">int</span> <span class="org-variable-name">N</span> = 777777;

    {
        <span class="org-type">List</span>&lt;<span class="org-type">Thread</span>&gt; <span class="org-variable-name">threads</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;&gt;();

        <span class="org-type">StringBuffer</span> <span class="org-variable-name">sb</span> = <span class="org-keyword">new</span> <span class="org-type">StringBuffer</span>();
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">N</span>; i++) {
            <span class="org-type">Thread</span> <span class="org-variable-name">t</span> = <span class="org-keyword">new</span> <span class="org-type">Thread</span>(() -&gt; {
                    sb.append(<span class="org-string">"."</span>);
            });
            threads.add(t);
            t.start();
        }
        <span class="org-keyword">for</span> (<span class="org-type">Thread</span> <span class="org-variable-name">t</span>: threads) {
            t.join();
        }
        System.out.println(sb.length());
    }

    {
        <span class="org-type">List</span>&lt;<span class="org-type">Thread</span>&gt; <span class="org-variable-name">threads</span> = <span class="org-keyword">new</span> <span class="org-type">ArrayList</span>&lt;&gt;();

        <span class="org-type">StringBuffer</span> <span class="org-variable-name">sb</span> = <span class="org-keyword">new</span> <span class="org-type">StringBuffer</span>();
        <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; <span class="org-type">N</span>; i++) {
            <span class="org-type">Thread</span> <span class="org-variable-name">t</span> = <span class="org-keyword">new</span> <span class="org-type">Thread</span>(() -&gt; {
                    sb.append(<span class="org-string">"."</span>);
            });
            threads.add(t);
            t.start();
        }
        <span class="org-keyword">for</span> (<span class="org-type">Thread</span> <span class="org-variable-name">t</span>: threads) {
            t.join();
        }
        System.out.println(sb.length());
    }
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 某某人</p>
<p class="date">Created: 2018-08-16 周四 08:01</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
